# languages info

class Language:
    def __init__(self, alphabet, statistic, IC_min, IC_max, MIC_min, MIC_max) -> None:
        self.alphabet = alphabet
        self.statistic = statistic
        self.IC_min = IC_min
        self.IC_max = IC_max
        self.MIC_min = MIC_min
        self.MIC_max = MIC_max

RU = Language(
    "абвгдеёжзийклмнопрстуфхцчшщъыьэюя ",
    {
        'а': 8.01, 'б': 1.59, 'в': 4.54, 'г': 1.70, 'д': 2.98, 'е': 8.45, 'ё': 0.04,
        'ж': 0.94, 'з': 1.65, 'и': 7.35, 'й': 1.21, 'к': 3.49, 'л': 4.40, 'м': 3.21, 'н': 6.70, 'о': 10.97,
        'п': 2.81, 'р': 4.73, 'с': 5.47, 'т': 6.26, 'у': 2.62, 'ф': 0.26, 'х': 0.97, 'ц': 0.48, 'ч': 1.44,
        'ш': 0.73, 'щ': 0.36, 'ъ': 0.04, 'ы': 1.90, 'ь': 1.74, 'э': 0.32, 'ю': 0.64, 'я': 2.01
    },
    0.03, 0.0529,
    0, 0)

EN = Language(
    "abcdefghijklmnopqrstuvwxyz ",
    {
        'a': 11.682, 'b': 4.434, 'c': 5.238, 'd': 3.174, 'e': 2.799, 'f': 4.027, 'g': 1.642, 'h': 4.200,
        'i': 7.294, 'j': 0.511, 'k': 0.856, 'l': 2.415, 'm': 3.826, 'n': 2.284, 'o': 7.631, 'p': 4.319,
        'q': 0.222, 'r': 2.826, 's': 6.686, 't': 15.978, 'u': 1.183, 'v': 0.824, 'w': 5.497, 'x': 0.045,
        'y': 0.763, 'z': 0.045
    },
    0.038, 0.0662,
    0, 0)